package lesson2;

public class codeforbattlefieldcyklus {

	public static void main(String[] args) {
//		int i = 0; // следит в каком квадрате мы сейчас находимся
//		int direction = 0; // следит куда мы двигаемся (вправо или влево)
//		while (true) { // запускаем вечный цикл
//			if ( direction == 0 && i < 8 ) { // проверяем куда мы двигаемся ( 0 вправо, 1 влево ). Если квадрат меньше 8
//				tankX += 64; // то передвигаем танк на квадрат правее
//				i++; // и добавляем к i + 1 
//			} else { // если же мы двигаемся в другую сторону и наш квадрат уже 8
//				tankX -= 64; // вычитает 1 квадрат 
//				i--; // вычитает от i - 1
//			}
//			if (i == 8) { // проверяем. Если i равно 8
//				direction = 1; // направление изменяется
//			} else if (i == 0) { // Если добрался до другой стороны
//				direction = 0; // То изменяет направление на другое
//			}

	}

}
